# IQR
### IQR= Q3(75th Percentile) - Q1(25th Percentile)

To remove outlier,<br>
**Lower Limit = Q1 - 1.5 * IQR
Upper Limit = Q3 + 1.5 * IQR**
<img src='https://phhp-faculty-cantrell.sites.medinfo.ufl.edu/files/2012/07/images-mod1-spread10.gif'>

In [4]:
import pandas as pd
df=pd.read_csv('heights.csv')
df.head()

  gender     height
0   Male  73.847017
1   Male  68.781904
2   Male  74.110105
3   Male  71.730978
4   Male  69.881796

In [5]:
df.shape

(10000, 2)

In [6]:
df.describe()

             height
count  10000.000000
mean      66.367560
std        3.847528
min       54.263133
25%       63.505620
50%       66.318070
75%       69.174262
max       78.998742

In [7]:
Q1 = df.height.quantile(0.25)
Q3 = df.height.quantile(0.75)
Q1,Q3

(63.50562048, 69.1742617275)

In [8]:
IQR=Q3-Q1
IQR

5.668641247499998

In [9]:
lower=Q1-(1.5*IQR)
upper=Q3+(1.5*IQR)
lower,upper

(55.00265860875, 77.67722359874999)

In [10]:
df[(df.height>upper) | (df.height<lower)]

      gender     height
994     Male  78.095867
1317    Male  78.462053
2014    Male  78.998742
3285    Male  78.528210
3757    Male  78.621374
6624  Female  54.616858
7294  Female  54.873728
9285  Female  54.263133

In [11]:
df=df[(df.height<upper) & (df.height>lower)]

In [12]:
df.shape

(9992, 2)